app/controllers/items_controller.rb

    def expensive
      @items = Item.where("price > 1000")
---
SELECT "items".* FROM "items" WHERE (price > 1000)

    def last
      @item = Item.last
---
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ?  [["LIMIT", 1]]

    def create
        @item = Item.create(rant_params)
---
INSERT INTO "items" ("price", "name", "weight", "description", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?)  [["price", 5678.0], ["name", "Name"], ["weight", 74.0], ["description", "Desc"], ["created_at", 2017-03-02 11:39:41 UTC], ["updated_at", 2017-03-02 11:39:41 UTC], ["image", "i2.jpeg"]]

    def update
      @item.update_attributes(rant_params)
---
UPDATE "items" SET "name" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "gggg"], ["description", "gggg"], ["price", 200.0], ["updated_at", 2017-02-21 11:19:44 UTC], ["id", 5]]

    def upvote
      @item.increment!(:votes_count)
---
UPDATE "items" SET "votes_count" = COALESCE("votes_count", 0) + 1 WHERE "items"."id" = ?  [["id", 1]]

      def find_item
        @item = Item.where(id: params[:id]).first
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 16], ["LIMIT", 1]]